Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70N20B.PIC
      <edc:SFRDef edc:_addr="0x40000030" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="HSMCI_RDR" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000034" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="HSMCI_TDR" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000038" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40000040" edc:access="rrrrrr-rrrrrrrrr--rr---r--rrrrrr" edc:cname="HSMCI_SR" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMDRDY" edc:desc="Command Ready (cleared by writing in HSMCI_CMDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready (cleared by reading HSMCI_RDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready (cleared by writing in HSMCI_TDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLKE" edc:desc="Data Block Ended (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTIP" edc:desc="Data Transfer in Progress (cleared at the end of CRC16 calculation)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOTBUSY" edc:desc="HSMCI Not Busy" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SDIOIRQA" edc:desc="SDIO Interrupt for Slot A (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDIOWAIT" edc:desc="SDIO Read Wait Operation Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSRCV" edc:desc="CE-ATA Completion Signal Received (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RINDE" edc:desc="Response Index Error (cleared by writing in HSMCI_CMDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RDIRE" edc:desc="Response Direction Error (cleared by writing in HSMCI_CMDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCRCE" edc:desc="Response CRC Error (cleared by writing in HSMCI_CMDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RENDE" edc:desc="Response End Bit Error (cleared by writing in HSMCI_CMDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTOE" edc:desc="Response Time-out Error (cleared by writing in HSMCI_CMDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCRCE" edc:desc="Data CRC Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTOE" edc:desc="Data Time-out Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSTOE" edc:desc="Completion Signal Time-out Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLKOVRE" edc:desc="DMA Block Overrun Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEMPTY" edc:desc="FIFO empty flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XFRDONE" edc:desc="Transfer Done flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKRCV" edc:desc="Boot Operation Acknowledge Received (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKRCVE" edc:desc="Boot Operation Acknowledge Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000044" edc:access="wwwwww-wwwwwwwww--ww---w--wwwwww" edc:cname="HSMCI_IER" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMDRDY" edc:desc="Command Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLKE" edc:desc="Data Block Ended Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTIP" edc:desc="Data Transfer in Progress Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOTBUSY" edc:desc="Data Not Busy Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SDIOIRQA" edc:desc="SDIO Interrupt for Slot A Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDIOWAIT" edc:desc="SDIO Read Wait Operation Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSRCV" edc:desc="Completion Signal Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RINDE" edc:desc="Response Index Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RDIRE" edc:desc="Response Direction Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCRCE" edc:desc="Response CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RENDE" edc:desc="Response End Bit Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTOE" edc:desc="Response Time-out Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCRCE" edc:desc="Data CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTOE" edc:desc="Data Time-out Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSTOE" edc:desc="Completion Signal Timeout Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLKOVRE" edc:desc="DMA Block Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEMPTY" edc:desc="FIFO empty Interrupt enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XFRDONE" edc:desc="Transfer Done Interrupt enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKRCV" edc:desc="Boot Acknowledge Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKRCVE" edc:desc="Boot Acknowledge Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000048" edc:access="wwwwww-wwwwwwwww--ww---w--wwwwww" edc:cname="HSMCI_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMDRDY" edc:desc="Command Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLKE" edc:desc="Data Block Ended Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTIP" edc:desc="Data Transfer in Progress Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOTBUSY" edc:desc="Data Not Busy Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SDIOIRQA" edc:desc="SDIO Interrupt for Slot A Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDIOWAIT" edc:desc="SDIO Read Wait Operation Status Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSRCV" edc:desc="Completion Signal received interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RINDE" edc:desc="Response Index Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RDIRE" edc:desc="Response Direction Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCRCE" edc:desc="Response CRC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RENDE" edc:desc="Response End Bit Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTOE" edc:desc="Response Time-out Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCRCE" edc:desc="Data CRC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTOE" edc:desc="Data Time-out Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSTOE" edc:desc="Completion Signal Time out Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLKOVRE" edc:desc="DMA Block Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEMPTY" edc:desc="FIFO empty Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XFRDONE" edc:desc="Transfer Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKRCV" edc:desc="Boot Acknowledge Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKRCVE" edc:desc="Boot Acknowledge Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
