Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70N20B.PIC
      <edc:AdjustPoint edc:_addr="0x40038528" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40038530" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:cname="USBHS_HSTPIPISR0" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINI" edc:desc="Received IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:desc="Transmitted OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPI" edc:desc="Transmitted SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:desc="Pipe Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:desc="NAKed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDI" edc:desc="Received STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:desc="Data Toggle Sequence" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:desc="Number of Busy Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:desc="Current Bank" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:desc="Read/Write Allowed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:desc="Configuration OK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:desc="Pipe Byte Count" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038534" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:cname="USBHS_HSTPIPISR1" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINI" edc:desc="Received IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:desc="Transmitted OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPI" edc:desc="Transmitted SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:desc="Pipe Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:desc="NAKed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDI" edc:desc="Received STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:desc="Data Toggle Sequence" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:desc="Number of Busy Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:desc="Current Bank" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:desc="Read/Write Allowed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:desc="Configuration OK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:desc="Pipe Byte Count" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038538" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:cname="USBHS_HSTPIPISR2" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINI" edc:desc="Received IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:desc="Transmitted OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPI" edc:desc="Transmitted SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:desc="Pipe Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:desc="NAKed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDI" edc:desc="Received STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:desc="Data Toggle Sequence" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:desc="Number of Busy Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:desc="Current Bank" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:desc="Read/Write Allowed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:desc="Configuration OK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:desc="Pipe Byte Count" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003853C" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:cname="USBHS_HSTPIPISR3" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINI" edc:desc="Received IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:desc="Transmitted OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPI" edc:desc="Transmitted SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:desc="Pipe Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:desc="NAKed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDI" edc:desc="Received STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:desc="Data Toggle Sequence" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:desc="Number of Busy Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:desc="Current Bank" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:desc="Read/Write Allowed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:desc="Configuration OK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:desc="Pipe Byte Count" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038540" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:cname="USBHS_HSTPIPISR4" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINI" edc:desc="Received IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:desc="Transmitted OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPI" edc:desc="Transmitted SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:desc="Pipe Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:desc="NAKed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDI" edc:desc="Received STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:desc="Data Toggle Sequence" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:desc="Number of Busy Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:desc="Current Bank" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:desc="Read/Write Allowed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:desc="Configuration OK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:desc="Pipe Byte Count" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038544" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:cname="USBHS_HSTPIPISR5" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINI" edc:desc="Received IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:desc="Transmitted OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPI" edc:desc="Transmitted SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:desc="Pipe Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:desc="NAKed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDI" edc:desc="Received STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:desc="Data Toggle Sequence" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:desc="Number of Busy Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:desc="Current Bank" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:desc="Read/Write Allowed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:desc="Configuration OK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:desc="Pipe Byte Count" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
